app/controllers/books_controller.rb

  def show
    @new_book = Book.new
  	@book = Book.find(params[:id])
    @books = Book.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def create
      @books = Book.all
      @new_book = Book.new
      @user = current_user
  	  book = Book.new(book_params)
      book.user_id = current_user.id
  	  if book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "あ"], ["body", "あ"], ["created_at", "2019-05-21 05:20:52.875703"], ["updated_at", "2019-05-21 05:20:52.875703"], ["user_id", 22]]

  def correct_user
    book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
  	book = Book.find(params[:id])
  	book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "新規編集"], ["body", "新規編集"], ["updated_at", "2019-05-22 04:42:05.542239"], ["id", 39]]