app/controllers/books_controller.rb

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "asdfgsdfaefayd"], ["updated_at", "2019-05-20 05:14:46.127397"], ["id", 9]]
---
  def update
  	book = Book.find(params[:id])
  	book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 14]]
---
  def destroy
  	book = Book.find(params[:id])
  	book.destroy